{
  "architectures": [
    "LolcatsModelForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attn": null,
  "attn_mode": "fused_chunk",
  "bos_token_id": 128000,
  "elementwise_affine": true,
  "eos_token_id": 128001,
  "expand_k": 1,
  "expand_v": 1,
  "feature_map": "lolcats_hedgehog",
  "fuse_cross_entropy": true,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_ratio": 4,
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "model_type": "lolcats",
  "norm_eps": 1e-06,
  "norm_feature_map": false,
  "norm_k": false,
  "norm_q": false,
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 500000.0,
  "tie_feature_map_qk": false,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.2",
  "use_cache": true,
  "vocab_size": 128256
}
